simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CRC_v2_50/API/CRC.h
/*******************************************************************************
* File Name: `$INSTANCE_NAME`.h
* Version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* Description:
*  This file provides constants and parameter values for the CRC component.
*
* Note:
*  None
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CRC_`$INSTANCE_NAME`_H)
#define CY_CRC_`$INSTANCE_NAME`_H

#include "cyfitter.h"
    
#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif


/***************************************
*   Conditional Compilation Parameters
****************************************/

#define `$INSTANCE_NAME`_CRC_SIZE                   (`$Resolution`u)
#define `$INSTANCE_NAME`_TIME_MULTIPLEXING_ENABLE   (`$TimeMultiplexing`u)


/***************************************
*       Type defines
***************************************/

/* Structure to save registers before go to sleep */
typedef struct
{
    uint8 enableState;

} `$INSTANCE_NAME`_BACKUP_STRUCT;

extern uint8 `$INSTANCE_NAME`_initVar;

extern `$INSTANCE_NAME`_BACKUP_STRUCT `$INSTANCE_NAME`_backup;


/***************************************
*        Function Prototypes
****************************************/

void `$INSTANCE_NAME`_Init(void) `=ReentrantKeil($INSTANCE_NAME . "_Init")`;
void `$INSTANCE_NAME`_Enable(void) `=ReentrantKeil($INSTANCE_NAME . "_Enable")`;
void `$INSTANCE_NAME`_Start(void) `=ReentrantKeil($INSTANCE_NAME . "_Start")`;
void `$INSTANCE_NAME`_Stop(void) `=ReentrantKeil($INSTANCE_NAME . "_Stop")`;
void `$INSTANCE_NAME`_SaveConfig(void) `=ReentrantKeil($INSTANCE_NAME . "_SaveConfig")`;
void `$INSTANCE_NAME`_Sleep(void) `=ReentrantKeil($INSTANCE_NAME . "_Sleep")`;
void `$INSTANCE_NAME`_RestoreConfig(void) `=ReentrantKeil($INSTANCE_NAME . "_RestoreConfig")`;
void `$INSTANCE_NAME`_Wakeup(void) `=ReentrantKeil($INSTANCE_NAME . "_Wakeup")`;

#if (`$INSTANCE_NAME`_CRC_SIZE <= 32u)    /* 8-32 bits CRC */
    `$RegSizeReplacementString` `$INSTANCE_NAME`_ReadCRC(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadCRC")`;
    void `$INSTANCE_NAME`_WriteSeed(`$RegSizeReplacementString` seed)  `=ReentrantKeil($INSTANCE_NAME . "_WriteSeed")`;
    `$RegSizeReplacementString` `$INSTANCE_NAME`_ReadPolynomial(void)
                                               `=ReentrantKeil($INSTANCE_NAME . "_ReadPolynomial")`;
    void `$INSTANCE_NAME`_WritePolynomial(`$RegSizeReplacementString` polynomial)
                                          `=ReentrantKeil($INSTANCE_NAME . "_WritePolynomial")`;

#else                                    /* 33-64 bits CRC */
    uint32 `$INSTANCE_NAME`_ReadCRCUpper(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadCRCUpper")`;
    uint32 `$INSTANCE_NAME`_ReadCRCLower(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadCRCLower")`;
    void `$INSTANCE_NAME`_WriteSeedUpper(uint32 seed) `=ReentrantKeil($INSTANCE_NAME . "_WriteSeedUpper")`;
    void `$INSTANCE_NAME`_WriteSeedLower(uint32 seed) `=ReentrantKeil($INSTANCE_NAME . "_WriteSeedLower")`;
    uint32 `$INSTANCE_NAME`_ReadPolynomialUpper(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadPolynomialUpper")`;
    uint32 `$INSTANCE_NAME`_ReadPolynomialLower(void) `=ReentrantKeil($INSTANCE_NAME . "_ReadPolynomialLower")`;
    void `$INSTANCE_NAME`_WritePolynomialUpper(uint32 polynomial)
                                                `=ReentrantKeil($INSTANCE_NAME . "_WritePolynomialUpper")`;
    void `$INSTANCE_NAME`_WritePolynomialLower(uint32 polynomial)
                                                `=ReentrantKeil($INSTANCE_NAME . "_WritePolynomialLower")`;

#endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */

#if (`$INSTANCE_NAME`_CRC_SIZE <= 32u) /* 8-32 bits CRC */
    void `$INSTANCE_NAME`_ResetSeedInit(`$RegSizeReplacementString` seed)
                                        `=ReentrantKeil($INSTANCE_NAME . "_ResetSeedInit")`;
#else
    void `$INSTANCE_NAME`_ResetSeedInitUpper(uint32 seed)
                                        `=ReentrantKeil($INSTANCE_NAME . "_ResetSeedInitUpper")`;
    void `$INSTANCE_NAME`_ResetSeedInitLower(uint32 seed)
                                        `=ReentrantKeil($INSTANCE_NAME . "_ResetSeedInitLower")`;
#endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */


/***************************************
*    Initial Parameter Constants
***************************************/

#if (`$INSTANCE_NAME`_CRC_SIZE <= 32u)
    #define `$INSTANCE_NAME`_DEFAULT_POLYNOM            (`$PolyValueLower`u)
    #define `$INSTANCE_NAME`_DEFAULT_SEED               (`$SeedValueLower`u)

#else
    #define `$INSTANCE_NAME`_DEFAULT_POLYNOM_UPPER      (`$PolyValueUpper`u)
    #define `$INSTANCE_NAME`_DEFAULT_POLYNOM_LOWER      (`$PolyValueLower`u)
    #define `$INSTANCE_NAME`_DEFAULT_SEED_UPPER         (`$SeedValueUpper`u)
    #define `$INSTANCE_NAME`_DEFAULT_SEED_LOWER         (`$SeedValueLower`u)

#endif  /* End (`$INSTANCE_NAME`_CRC_SIZE <= 32u) */


/***************************************
*           API Constants
***************************************/

#define `$INSTANCE_NAME`_MASK                           (`$Mask`u)


/***************************************
*             Registers
***************************************/

#define `$INSTANCE_NAME`_EXECUTE_DFF_RESET    { `$INSTANCE_NAME`_CONTROL_REG |= `$INSTANCE_NAME`_CTRL_RESET; \
    `$INSTANCE_NAME`_CONTROL_REG &= (uint8)~`$INSTANCE_NAME`_CTRL_RESET; }


#if (`$INSTANCE_NAME`_TIME_MULTIPLEXING_ENABLE)
    #if (`$INSTANCE_NAME`_CRC_SIZE <= 16u)      /* 16 bits CRC */
        /* Polynomial */
        #define `$INSTANCE_NAME`_POLYNOM_A__D1_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed */
        #define `$INSTANCE_NAME`_SEED_A__A1_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_A__A1_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY */
        #define `$INSTANCE_NAME`_SEED_COPY_A__A1_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A1_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 24u)      /* 24 bits CRC */
        /* Polynomial */
        #define `$INSTANCE_NAME`_POLYNOM_B__D1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed */
        #define `$INSTANCE_NAME`_SEED_B__A1_REG             (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_B__A1_PTR             ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_B__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_B__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY */
        #define `$INSTANCE_NAME`_SEED_COPY_B__A1_REG        (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A1_PTR        ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 32u)      /* 32 bits CRC */
        /* Polynomial */
        #define `$INSTANCE_NAME`_POLYNOM_B__D1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D1_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_B__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_A__D0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed */
        #define `$INSTANCE_NAME`_SEED_B__A1_REG             (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_B__A1_PTR             ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_A__A1_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_A__A1_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_B__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_B__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_REG             (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_A__A0_PTR             ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY */
        #define `$INSTANCE_NAME`_SEED_COPY_B__A1_REG        (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A1_PTR        ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A1_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A1_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_B__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_REG        (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_COPY_A__A0_PTR        ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 40u)      /* 40 bits CRC */
        /* Polynomial Upper */
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        /* Polynomial Lower */
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        /* Seed Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        /* Seed COPY Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

    #elif (`$INSTANCE_NAME`_CRC_SIZE <= 48u)      /* 48 bits CRC */
        /* Polynomial Upper */
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_C__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_B__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_UPPER_B__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D1_REG )
        /* Polynomial Lower */
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D1_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D1_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D1_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_C__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_B__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_REG            (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        #define `$INSTANCE_NAME`_POLYNOM_LOWER_A__D0_PTR            ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__D0_REG )
        /* Seed Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_C__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_B__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_B__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A1_REG )
        /* Seed Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A1_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A1_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_C__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_B__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_REG               (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_A__A0_PTR               ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__A0_REG )
        /* Seed COPY Upper */
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_C__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_B__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        #define `$INSTANCE_NAME`_SEED_UPPER_COPY_B__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F1_REG )
        /* Seed COPY Lower */
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A1_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A1_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F1_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_C__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b2_CRCdp_c__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_B__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b1_CRCdp_b__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_REG          (*(reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )
        #define `$INSTANCE_NAME`_SEED_LOWER_COPY_A__A0_PTR          ( (reg8 *) `$INSTANCE_NAME`_b0_CRCdp_a__F0_REG )

